Revit 2023 API
STLExportOptions Constructor
Overload List
Name | Description
STLExportOptions()
 Constructs a new instance of STLExportOptions with default values of all properties.
STLExportOptions(ExportResolution)
 Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values.
STLExportOptions(STLExportResolution) |  Obsolete.
 Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on STL export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values.
See Also
STLExportOptions Class
STLExportOptions Members
Autodesk.Revit.DB Namespace